; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	thermograph1 - mode
	image0 - mode
	image2 - mode
	Star1 - direction
	Star3 - direction
	GroundStation4 - direction
	GroundStation0 - direction
	Star2 - direction
	Star5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 image0)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star14)
	(supports instrument1 image0)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 GroundStation4)
	(calibration_target instrument1 Star2)
	(supports instrument2 image2)
	(supports instrument2 thermograph1)
	(supports instrument2 image0)
	(calibration_target instrument2 Star2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet9)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 Star5)
	(supports instrument4 image2)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 GroundStation0)
	(calibration_target instrument4 Star6)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star14)
	(supports instrument5 thermograph1)
	(supports instrument5 image2)
	(supports instrument5 image0)
	(calibration_target instrument5 Star2)
	(supports instrument6 image0)
	(supports instrument6 thermograph1)
	(calibration_target instrument6 Star5)
	(supports instrument7 image0)
	(supports instrument7 thermograph1)
	(calibration_target instrument7 Star6)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon13)
)
(:goal (and
	(pointing satellite1 Star3)
	(have_image Phenomenon7 thermograph1)
	(have_image Phenomenon8 image2)
	(have_image Planet9 image2)
	(have_image Phenomenon10 image2)
	(have_image Planet11 image2)
	(have_image Planet12 image2)
	(have_image Phenomenon13 thermograph1)
	(have_image Star14 thermograph1)
))

)

; plan
1. (turn_to satellite2 groundstation0 star14)
   deleted: (pointing satellite2 star14)
   added: (pointing satellite2 groundstation0)
   goals met: 0 of 9
2. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 9
3. (calibrate satellite2 instrument4 groundstation0)
   added: (calibrated instrument4)
   goals met: 0 of 9
4. (turn_to satellite2 phenomenon7 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 phenomenon7)
   goals met: 0 of 9
5. (take_image satellite2 phenomenon7 instrument4 thermograph1)
   added: (have_image phenomenon7 thermograph1)
   goals met: 1 of 9
6. (turn_to satellite2 phenomenon13 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 phenomenon13)
   goals met: 1 of 9
7. (take_image satellite2 phenomenon13 instrument4 thermograph1)
   added: (have_image phenomenon13 thermograph1)
   goals met: 2 of 9
8. (turn_to satellite2 phenomenon10 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 phenomenon10)
   goals met: 2 of 9
9. (turn_to satellite1 star3 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star3)
   goals met: 3 of 9
10. (take_image satellite2 phenomenon10 instrument4 image2)
   added: (have_image phenomenon10 image2)
   goals met: 4 of 9
11. (turn_to satellite2 phenomenon8 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 phenomenon8)
   goals met: 4 of 9
12. (take_image satellite2 phenomenon8 instrument4 image2)
   added: (have_image phenomenon8 image2)
   goals met: 5 of 9
13. (turn_to satellite2 planet11 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 planet11)
   goals met: 5 of 9
14. (take_image satellite2 planet11 instrument4 image2)
   added: (have_image planet11 image2)
   goals met: 6 of 9
15. (turn_to satellite2 planet12 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 planet12)
   goals met: 6 of 9
16. (take_image satellite2 planet12 instrument4 image2)
   added: (have_image planet12 image2)
   goals met: 7 of 9
17. (turn_to satellite2 planet9 planet12)
   deleted: (pointing satellite2 planet12)
   added: (pointing satellite2 planet9)
   goals met: 7 of 9
18. (take_image satellite2 planet9 instrument4 image2)
   added: (have_image planet9 image2)
   goals met: 8 of 9
19. (turn_to satellite2 star14 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 star14)
   goals met: 8 of 9
20. (take_image satellite2 star14 instrument4 thermograph1)
   added: (have_image star14 thermograph1)
   goals met: 9 of 9
